<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas II

## 1.0 Importing our Libraries

In [1]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file

This dataset contains trips taken by thousands of kenyans to and from Nairobi during the year 2018.

*   Dataset link for download or access: [Link](https://drive.google.com/a/moringaschool.com/file/d/1xe2sHapdeGo7bIaiG7UV0rjgQZ5U6OXv/view?usp=sharing)

In [4]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
data_url = 'datasets/bus_travels.csv'
df = pd.read_csv(data_url)
df.head(5)

,ride_id,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,247,2018-05-07,07:06,Kisii,Nairobi,Bus,49
1,256,2018-05-06,11:08,Kisii,Nairobi,shuttle,11
2,275,2018-05-04,05:00,Kisii,Nairobi,shuttle,11
3,285,2018-05-04,09:10,Kisii,Nairobi,shuttle,11
4,286,2018-05-04,09:20,Kisii,Nairobi,shuttle,11

## 1.2 Previewing our Dataset

In [5]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

,ride_id,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,247,2018-05-07,07:06,Kisii,Nairobi,Bus,49
1,256,2018-05-06,11:08,Kisii,Nairobi,shuttle,11
2,275,2018-05-04,05:00,Kisii,Nairobi,shuttle,11
3,285,2018-05-04,09:10,Kisii,Nairobi,shuttle,11
4,286,2018-05-04,09:20,Kisii,Nairobi,shuttle,11
5,287,2018-05-04,07:02,Kisii,Nairobi,Bus,49
6,288,2018-05-04,09:30,Kisii,Nairobi,shuttle,11
7,292,2018-05-04,19:03,Kisii,Nairobi,Bus,49
8,298,2018-05-04,09:00,Kisii,Nairobi,shuttle,11
9,302,2018-05-04,08:40,Kisii,Nairobi,shuttle,11

## 1.3 Accessing Information about our Dataset

In [6]:
# Getting to know more about the dataset by accessing its information
#
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1111 entries, 0 to 1110
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ride_id       1111 non-null   int64
 1   travel_date   1111 non-null   object
 2   travel_time   1111 non-null   object
 3   travel_from   1111 non-null   object
 4   travel_to     1111 non-null   object
 5   car_type      1111 non-null   object
 6   max_capacity  1111 non-null   int64
dtypes: int64(2), object(5)
memory usage: 39.1+ KB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [29]:
# Challenge 1
# How many trips were taken on the 22/04/18?
# 
df['travel_date'] = pd.to_datetime(df['travel_date'], format="%Y-%m-%d")
df['travel_time'] = pd.to_datetime(df['travel_time'], format="%H:%M")
df['travel_time'] = [time.time() for time in df['travel_time']]

trips = df[df['travel_date'] == '2018-04-22']
print(f"Trips made during the period is {len(trips)}")

Trips made during the period is 66

In [39]:
# Challenge 2
# Which type of vehicle travelled on 23/04/18 from Kisii to Nairobi at 7.15am?
#
df[(df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi') & (df['travel_date'] == "2018/04/23") & (df['travel_time'] == '07:15:00')]

Empty DataFrame
Columns: [ride_id, travel_date, travel_time, travel_from, travel_to, car_type, max_capacity]
Index: []

In [40]:
# Challenge 3
# How many trips were made from Kisii to Nairobi?
# 
len(df[(df['travel_from'] == 'Kisii') & (df['travel_to'] == 'Nairobi')])

545

In [48]:
# Challenge 4
# How many trips were made by shuttle from Nairobi?
# 
len(df[(df['car_type'] == 'shuttle') & (df['travel_from'] == 'Nairobi')])

0

In [49]:
# Challenge 5
# How many trips were made by bus from Nairobi to Awendo?
# 
len(df[(df['travel_from'] == 'Nairobi') & (df['travel_to'] == 'Awendo')])

0

In [108]:
# Challenge 6
# Which was the most travelled from destination by bus?
# 
df['count']  = 1
group_data = df.groupby(['travel_from', 'car_type'])['count'].count()
index = group_data.index

bus_travels = {}

for val in index:
    if val[1]== "Bus":
        bus_travels[val] = group_data[val]

        
all_values = bus_travels.values()
max_value = max(all_values)

for key,value in bus_travels.items():
    if value == max_value:
        print(key, value)

('Rongo', 'Bus') 115

In [115]:
# Challenge 7
# Which was the most travelled to destination?
# 
to_list = list(df['travel_to'])
destinations = set(df['travel_to'])

from collections import Counter
Counter(to_list)

Counter({'Nairobi': 1111})

In [0]:
# Challenge 8
# Which was the most travelled destination by bus?
# 
OUR CODE GOES HERE

In [0]:
# Challenge 9
# Which town did not have a departure by shuttle?
# 
OUR CODE GOES HERE

In [0]:
# Challenge 10
# Which were the most 5 travelled to destinations?
# 
OUR CODE GOES HERE

In [0]:
# Challenge 11
# Which were the least 5 travelled to destinations?
#
OUR CODE GOES HERE

In [0]:
# Challenge 12
# If all shuttles travelled with full capacity, how many people travelled in shuttles from Kisii to Nairobi in the month of May?
#
OUR CODE GOES HERE

In [0]:
# Challenge 13
# Which date had the highest no. of trips in June?
#
OUR CODE GOES HERE

In [0]:
# Challenge 14
# On average, how many trips were made by all vehicles in a day?
#
OUR CODE GOES HERE

In [0]:
# Challenge 15 
# On average, how many buses and shuttles travelled in a day?
# 
OUR CODE GOES HERE